VARIABLE DECLARATIONS
	ALPHANUMERIC - I-CAMPGROUND, I-SITE-L, I-DATE, I-LNAME, I-FNAME, I-CCTYPE, AMT-SW, FIRST-ERR-SW
	NUMERIC - I-LEN-STAY, I-AMT, I-CCNUM, I-CCEXP, I-SITE-N, I.

L1-MAIN
	L2-INIT
	WHILE MORE-RECS = "YES"
		L2-MAINLINE
	L2-CLOSING

L2-INIT
	OPEN INPUT FILE
	OPEN OUTPUT FILE
	REQUEST SYSTEM DATE
	GET I-DATE
	O-DATE = I-DATE
	READ
	HEADINGS
	ERR-HEADINGS

L2-MAINLINE
	PERFORM L3-VALIDATION THRU L3-VALIDATION-EXIT.
	PERFORM L3-CALCS
	PERFORM L3-OUTPUT
	PERFORM L3-READ.

L3-VALIDATION
	MOVE "Y" TO FIRST-ERR-SW
	MOVE "N" TO AMT-SW
	MOVE SPACES TO O-ERR
	IF VAL-CAMP
		MOVE TBL-ERR(1) TO O-ERR
		PERFORM L4-ERROR
	IF I-SITE-L NOT = ALPHABETIC
		MOVE TBL-ERR(2) TO O-ERR
		PERFORM L4-ERROR.
	IF I-SITE-N NOT = NUMERIC
		MOVE TBL-ERR(3) TO O-ERR
		PERFORM L4-ERROR.
	IF I-SITE-N < 0
		MOVE TBL-ERR(4) TO O-ERR
		PERFORM L4-ERROR.
	IF I-DATE NOT = NUMERIC
		MOVE TBL-ERR(5) TO O-ERR
		PERFORM L4-ERROR.
	IF VAL-MONTH
		MOVE TBL-ERR(6) TO O-ERR
		PERFORM L4-ERROR.
	IF I-DATE > I-CURDATE
		MOVE TBL-ERR(7) TO O-ERR
		PERFORM L4-ERROR.
	IF VAL-31MONTH
		IF VAL-31-DAY
			MOVE TBL-ERR(8) TO O-ERR
			PERFORM L4-ERROR
	IF VAL-30MONTH
		IF VAL-30-DAY
			MOVE TBL-ERR(10) TO O-ERR
			PERFORM L4-ERROR
	IF VAL-LEAP-MONTH
		IF I-YY % 4 > 0
			LEAP-SW = 'N'
		ELSE
			IF I-YY % 100 = 0
				IF I-YY % 400 = 0
					LEAP-SW = 'Y'
				ELSE
					LEAP-SW = 'N'
			ELSE
				LEAP-SW = 'Y'
		IF LEAP-SW = 'Y'
			IF VAL-29-DAY
				MOVE TBL-ERR(11) TO O-ERR
				PERFORM L4-ERROR
			ELSE
				CONTINUE
		ELSE
			IF VAL-28-DAY
				MOVE TBL-ERR(11) TO O-ERR
				PERFORM L4-ERROR.
	IF I-LEN-STAY NOT = NUMERIC
		MOVE "Y" TO AMT-SW
		MOVE TBL-ERR(9) TO O-ERR
		PERFORM L4-ERROR.
	IF I-LEN-STAY < 1 OR I-LEN-STAY > 12
		MOVE TBL-ERR(10) TO O-ERR
		PERFORM L4-ERROR.
	IF I-FNAME = SPACES
		MOVE TBL-ERR(11) TO O-ERR
		PERFORM L4-ERROR.
	IF I-LNAME = SPACES
		MOVE TBL-ERR(12) TO O-ERR
		PERFORM L4-ERROR.
	IF I-AMT NOT = NUMERIC
		MOVE TBL-ERR(13) TO O-ERR
		PERFORM L4-ERROR
	ELSE
		IF AMT-SW = 'Y'
			NEXT SENTENCE
		ELSE
			PERFORM
				VARYING I FROM 1 BY 1
					UNTIL TBL-SITE(I) = I-SITE-N
			COMPUTE C-AMT = TBL-DAY-AMT(I) * I-LEN-STAY
			IF C-AMT NOT= I-AMT
				MOVE TBL-ERR(14) TO O-ERR
				PERFORM L4-ERROR.
	IF VAL-CCTYPE
		MOVE TBL-ERR(15) TO O-ERR
		PERFORM L4-ERROR.
	IF I-CCNUM NOT= NUMERIC
		MOVE TBL-ERR(16) TO O-ERR
		PERFORM L4-ERROR.
	IF I-DATE NOT = NUMERIC
		MOVE TBL-ERR(17) TO O-ERR
		PERFORM L4-ERROR.
	IF VAL-MONTH
		MOVE TBL-ERR(18) TO O-ERR
		PERFORM L4-ERROR.
	IF I-CCEXP NOT= NUMERIC
		MOVE TBL-ERR() TO O-ERR
		PERFORM L4-ERROR.
	IF I-CCEXP > I-CURDATE
		MOVE TBL-ERR(19) TO O-ERR
		PERFORM L4-ERROR.
	IF VALCC-31MONTH
		IF VALCC-31-DAY
			MOVE TBL-ERR(8) TO O-ERR
			PERFORM L4-ERROR
	IF VALCC-30MONTH
		IF VALCC-30-DAY
			MOVE TBL-ERR(10) TO O-ERR
			PERFORM L4-ERROR
	IF VALCC-LEAP-MONTH
		IF I-YY % 4 > 0
			LEAP-SW = 'N'
		ELSE
			IF I-YY % 100 = 0
				IF I-YY % 400 = 0
					LEAP-SW = 'Y'
				ELSE
					LEAP-SW = 'N'
			ELSE
				LEAP-SW = 'Y'
		IF LEAP-SW = 'Y'
			IF VALCC-29-DAY
				MOVE TBL-ERR(11) TO O-ERR
				PERFORM L4-ERROR
			ELSE
				CONTINUE
		ELSE
			IF VALCC-28-DAY
				MOVE TBL-ERR(11) TO O-ERR
				PERFORM L4-ERROR.
	IF O-ERR = SPACES
		MOVE "N" TO FIRST-ERR-SW.

VALIDATION-EXIT
	EXIT.

CALCS
		IF VAL-31-MONTH
		ADD I-DATE to I-LEN-STAY GIVING END-DATE
		IF VAL-31-DAY
			ADD 1 TO MONTH
			SUBTRACT 31 FROM DAY
			IF VAL-MONTH
				ADD 1 TO YEAR
				SUBTRACT 12 FROM MONTH.


OUTPUT
	PRINT DETAIL LINE O-LNAME, O-FNAME, O-CITY, O-STATE, O-ZIP, O-POP-TYPE, O-QTY, O-DEPOSIT-AMT, O-TOT-SALES.
		AT EOP
			CALL HEADINGS.
	PRINT BLANK LINE.

ERR-ROUT
	IF FIRST-ERR-SW = 'Y'
	 	MOVE 'N' TO FIRST-ERR-SW
	 	ADD 1 TO REC-ERR-CTR.
	 	MOVE TRAN-REC TO O-REC-DUMP
	 	WRITE ERRLINE FROM O-REC-LINE
		  	AFTER ADVANCING 1 LINE
	 	WRITE ERRLINE FROM O-ERR-LINE
		  	AFTER ADVANCING 1 LINE
	ELSE
	 	WRITE ERRLINE FROM O-ERR-LINE
		  	AFTER ADVANCING 1 LINE.
	ADD 1 TO TOT-ERR-CTR.

L3-CLOSING
	GRANDTOTALS
	CLOSE INPUT FILE
	CLOSE OUTPUT FILE

GRANDTOTALS
	O-GT-QTY-COKE = C-GT-QTY-COKE
	O-GT-QTY-DTCOKE = C-GT-QTY-DTCOKE
	O-GT-QTY-MELLOW = C-GT-QTY-MELLOW
	O-GT-QTY-CHERRY-COKE = C-GT-QTY-CHERRY-COKE
	O-GT-QTY-CHERRY-DTCOKE = C-GT-QTY-CHERRY-DTCOKE
	O-GT-QTY-SPRITE = C-GT-QTY-SPRITE
	O-GT-TEAM-A = C-GT-TEAM-A
	O-GT-TEAM-B = C-GT-TEAM-B
	O-GT-TEAM-C = C-GT-TEAM-C
	O-GT-TEAM-D = C-GT-TEAM-D
	O-GT-TEAM-E = C-GT-TEAM-E
	O-ERR-COUNT = C-ERR-COUNT

	PERFORM HEADINGS
		AFTER ADVANCING 1 PAGE.
	PRINT GRAND TOTAL LINE O-GT-QTY-COKE, O-GT-QTY-DTCOKE, O-GT-QTY-MELLOW, O-GT-QTY-CHERRY-COKE, O-GT-QTY-CHERRY-DTCOKE, O-GT-QTY-SPRITE
		O-GT-TEAM-A, O-GT-TEAM-B, O-GT-TEAM-C, O-GT-TEAM-D, O-GT-TEAM-E.

	PRINT ERROR-TOTAL LINE O-ERR-COUNT.

READ
	READ RECORD, I-LNAME, I-FNAME, I-ADDRESS, I-CITY, I-STATE, I-ZIP, I-POP-TYPE, I-#CASES, I-TEAM
	IF END OF FILE
		MORE-RECTS = "NO"
